; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared3 - mode
	thermograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 107)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 188)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 102)
	(= (data Planet5 infrared3) 280)
	(= (data Planet6 infrared3) 21)
	(= (data Phenomenon7 infrared3) 67)
	(= (data Phenomenon8 infrared3) 187)
	(= (data Planet5 thermograph0) 142)
	(= (data Planet6 thermograph0) 249)
	(= (data Phenomenon7 thermograph0) 195)
	(= (data Phenomenon8 thermograph0) 52)
	(= (data Planet5 thermograph2) 298)
	(= (data Planet6 thermograph2) 148)
	(= (data Phenomenon7 thermograph2) 82)
	(= (data Phenomenon8 thermograph2) 99)
	(= (data Planet5 infrared1) 296)
	(= (data Planet6 infrared1) 214)
	(= (data Phenomenon7 infrared1) 36)
	(= (data Phenomenon8 infrared1) 83)
	(= (slew_time GroundStation4 GroundStation0) 33.93)
	(= (slew_time GroundStation0 GroundStation4) 33.93)
	(= (slew_time GroundStation4 GroundStation1) 5.542)
	(= (slew_time GroundStation1 GroundStation4) 5.542)
	(= (slew_time GroundStation4 Star2) 52.85)
	(= (slew_time Star2 GroundStation4) 52.85)
	(= (slew_time GroundStation4 GroundStation3) 5.084)
	(= (slew_time GroundStation3 GroundStation4) 5.084)
	(= (slew_time Star2 GroundStation0) 15.83)
	(= (slew_time GroundStation0 Star2) 15.83)
	(= (slew_time Star2 GroundStation1) 22.37)
	(= (slew_time GroundStation1 Star2) 22.37)
	(= (slew_time GroundStation3 GroundStation0) 54.33)
	(= (slew_time GroundStation0 GroundStation3) 54.33)
	(= (slew_time GroundStation3 GroundStation1) 7.588)
	(= (slew_time GroundStation1 GroundStation3) 7.588)
	(= (slew_time GroundStation3 Star2) 75.71)
	(= (slew_time Star2 GroundStation3) 75.71)
	(= (slew_time GroundStation1 GroundStation0) 37.39)
	(= (slew_time GroundStation0 GroundStation1) 37.39)
	(= (slew_time Planet5 GroundStation0) 36.64)
	(= (slew_time GroundStation0 Planet5) 36.64)
	(= (slew_time Planet5 GroundStation1) 9.294)
	(= (slew_time GroundStation1 Planet5) 9.294)
	(= (slew_time Planet5 Star2) 6.255)
	(= (slew_time Star2 Planet5) 6.255)
	(= (slew_time Planet5 GroundStation3) 8.74)
	(= (slew_time GroundStation3 Planet5) 8.74)
	(= (slew_time Planet5 GroundStation4) 55.01)
	(= (slew_time GroundStation4 Planet5) 55.01)
	(= (slew_time Planet6 GroundStation0) 61.51)
	(= (slew_time GroundStation0 Planet6) 61.51)
	(= (slew_time Planet6 GroundStation1) 11.33)
	(= (slew_time GroundStation1 Planet6) 11.33)
	(= (slew_time Planet6 Star2) 15.43)
	(= (slew_time Star2 Planet6) 15.43)
	(= (slew_time Planet6 GroundStation3) 56.93)
	(= (slew_time GroundStation3 Planet6) 56.93)
	(= (slew_time Planet6 GroundStation4) 42.56)
	(= (slew_time GroundStation4 Planet6) 42.56)
	(= (slew_time Planet6 Planet5) 32.6)
	(= (slew_time Planet5 Planet6) 32.6)
	(= (slew_time Phenomenon7 GroundStation0) 78.38)
	(= (slew_time GroundStation0 Phenomenon7) 78.38)
	(= (slew_time Phenomenon7 GroundStation1) 48.17)
	(= (slew_time GroundStation1 Phenomenon7) 48.17)
	(= (slew_time Phenomenon7 Star2) 40.82)
	(= (slew_time Star2 Phenomenon7) 40.82)
	(= (slew_time Phenomenon7 GroundStation3) 12.08)
	(= (slew_time GroundStation3 Phenomenon7) 12.08)
	(= (slew_time Phenomenon7 GroundStation4) 5.411)
	(= (slew_time GroundStation4 Phenomenon7) 5.411)
	(= (slew_time Phenomenon7 Planet5) 63.74)
	(= (slew_time Planet5 Phenomenon7) 63.74)
	(= (slew_time Phenomenon7 Planet6) 24.78)
	(= (slew_time Planet6 Phenomenon7) 24.78)
	(= (slew_time Phenomenon8 GroundStation0) 9.934)
	(= (slew_time GroundStation0 Phenomenon8) 9.934)
	(= (slew_time Phenomenon8 GroundStation1) 48.89)
	(= (slew_time GroundStation1 Phenomenon8) 48.89)
	(= (slew_time Phenomenon8 Star2) 47.74)
	(= (slew_time Star2 Phenomenon8) 47.74)
	(= (slew_time Phenomenon8 GroundStation3) 40.37)
	(= (slew_time GroundStation3 Phenomenon8) 40.37)
	(= (slew_time Phenomenon8 GroundStation4) 17.14)
	(= (slew_time GroundStation4 Phenomenon8) 17.14)
	(= (slew_time Phenomenon8 Planet5) 12.35)
	(= (slew_time Planet5 Phenomenon8) 12.35)
	(= (slew_time Phenomenon8 Planet6) 62.36)
	(= (slew_time Planet6 Phenomenon8) 62.36)
	(= (slew_time Phenomenon8 Phenomenon7) 59.52)
	(= (slew_time Phenomenon7 Phenomenon8) 59.52)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 GroundStation0)
	(pointing satellite2 Phenomenon7)
	(have_image Planet5 thermograph0)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 groundstation4 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation4)
   changed: (fuel satellite2) from 102 to 46.99, (fuel-used) from 0 to 55.01
   goals met: 0 of 6
2. (turn_to satellite1 groundstation0 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 188 to 172.17, (fuel-used) from 55.01 to 70.84
   goals met: 1 of 6
3. (turn_to satellite0 star2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 107 to 59.26, (fuel-used) from 70.84 to 118.58
   goals met: 1 of 6
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
5. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 59.26 to 53.005, (fuel-used) from 118.58 to 124.835
   goals met: 1 of 6
7. (turn_to satellite2 phenomenon7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 46.99 to 41.579, (fuel-used) from 124.835 to 130.246
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon8)
   changed: (fuel satellite0) from 53.005 to 40.655, (fuel-used) from 130.246 to 142.596
   goals met: 2 of 6
9. (take_image satellite0 phenomenon8 instrument1 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 948, (data-stored) from 0 to 52
   goals met: 3 of 6
10. (turn_to satellite0 planet5 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 40.655 to 28.305, (fuel-used) from 142.596 to 154.946
   goals met: 3 of 6
11. (take_image satellite0 planet5 instrument1 thermograph0)
   added: (have_image planet5 thermograph0)
   changed: (data_capacity satellite0) from 948 to 806, (data-stored) from 52 to 194
   goals met: 4 of 6
12. (turn_to satellite0 groundstation1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 28.305 to 19.011, (fuel-used) from 154.946 to 164.24
   goals met: 4 of 6
13. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 19.011 to 7.681, (fuel-used) from 164.24 to 175.57
   goals met: 5 of 6
14. (turn_to satellite2 groundstation4 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation4)
   changed: (fuel satellite2) from 41.579 to 36.168, (fuel-used) from 175.57 to 180.981
   goals met: 4 of 6
15. (turn_to satellite2 phenomenon7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 36.168 to 30.757, (fuel-used) from 180.981 to 186.392
   goals met: 5 of 6
16. (turn_to satellite2 groundstation4 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation4)
   changed: (fuel satellite2) from 30.757 to 25.346, (fuel-used) from 186.392 to 191.803
   goals met: 4 of 6
17. (turn_to satellite2 groundstation1 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 25.346 to 19.804, (fuel-used) from 191.803 to 197.345
   goals met: 4 of 6
18. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 4 of 6
19. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 4 of 6
20. (turn_to satellite2 groundstation4 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 groundstation4)
   changed: (fuel satellite2) from 19.804 to 14.262, (fuel-used) from 197.345 to 202.887
   goals met: 4 of 6
21. (turn_to satellite2 phenomenon7 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 14.262 to 8.851, (fuel-used) from 202.887 to 208.298
   goals met: 5 of 6
22. (take_image satellite2 phenomenon7 instrument4 infrared1)
   added: (have_image phenomenon7 infrared1)
   changed: (data_capacity satellite2) from 1000 to 964, (data-stored) from 194 to 230
   goals met: 6 of 6
